{
  "100": {
    "code": "100",
    "description": "indicates that the initial part of a request has been received and has not yet been rejected by the server.",
    "phrase": "Continue"
  },
  "101": {
    "description": "indicates that the server understands and is willing to comply with the client's request, via the Upgrade header field, for a change in the application protocol being used on this connection.",
    "phrase": "Switching Protocols"
  },
  "102": {
    "description": "is an interim response used to inform the client that the server has accepted the complete request, but has not yet completed it.",
    "phrase": "Processing"
  },
  "200": {
    "description": "indicates that the request has succeeded.",
    "phrase": "OK"
  },
  "201": {
    "description": "indicates that the request has been fulfilled and has resulted in one or more new resources being created.",
    "phrase": "Created"
  },
  "202": {
    "description": "indicates that the request has been accepted for processing, but the processing has not been completed.",
    "phrase": "Accepted"
  },
  "203": {
    "description": "indicates that the request was successful but the enclosed payload has been modified from that of the origin server's 200 (OK) response by a transforming proxy.",
    "phrase": "Non-Authoritative Information"
  },
  "204": {
    "description": "indicates that the server has successfully fulfilled the request and that there is no additional content to send in the response payload body.",
    "phrase": "No Content"
  },
  "205": {
    "description": "indicates that the server has fulfilled the request and desires that the user agent reset the \"document view\", which caused the request to be sent, to its original state as received from the origin server.",
    "phrase": "Reset Content"
  },
  "206": {
    "description": "indicates that the server is successfully fulfilling a range request for the target resource by transferring one or more parts of the selected representation that correspond to the satisfiable ranges found in the requests's Range header field.",
    "phrase": "Partial Content"
  },
  "207": {
    "description": "provides status for multiple independent operations.",
    "phrase": "Multi-Status"
  },
  "226": {
    "description": "The server has fulfilled a GET request for the resource, and the response is a representation of the result of one or more instance-manipulations applied to the current instance.",
    "phrase": "IM Used"
  },
  "300": {
    "description": "indicates that the target resource has more than one representation, each with its own more specific identifier, and information about the alternatives is being provided so that the user (or user agent) can select a preferred representation by redirecting its request to one or more of those identifiers.",
    "phrase": "Multiple Choices"
  },
  "301": {
    "description": "indicates that the target resource has been assigned a new permanent URI and any future references to this resource ought to use one of the enclosed URIs.",
    "phrase": "Moved Permanently"
  },
  "302": {
    "description": "indicates that the target resource resides temporarily under a different URI.",
    "phrase": "Found"
  },
  "303": {
    "description": "indicates that the server is redirecting the user agent to a different resource, as indicated by a URI in the Location header field, that is intended to provide an indirect response to the original request.",
    "phrase": "See Other"
  },
  "304": {
    "description": "indicates that a conditional GET request has been received and would have resulted in a 200 (OK) response if it were not for the fact that the condition has evaluated to false.",
    "phrase": "Not Modified"
  },
  "305": {
    "description": "*deprecated*",
    "phrase": "Use Proxy"
  },
  "307": {
    "description": "indicates that the target resource resides temporarily under a different URI and the user agent MUST NOT change the request method if it performs an automatic redirection to that URI.",
    "phrase": "Temporary Redirect"
  },
  "308": {
    "description": "The target resource has been assigned a new permanent URI and any future references to this resource outght to use one of the enclosed URIs. [...] This status code is similar to 301 Moved Permanently (Section 7.3.2 of rfc7231), except that it does not allow rewriting the request method from POST to GET.",
    "phrase": "Permanent Redirect"
  },
  "400": {
    "description": "indicates that the server cannot or will not process the request because the received syntax is invalid, nonsensical, or exceeds some limitation on what the server is willing to process.",
    "phrase": "Bad Request"
  },
  "401": {
    "description": "indicates that the request has not been applied because it lacks valid authentication credentials for the target resource.",
    "phrase": "Unauthorized"
  },
  "402": {
    "description": "*reserved*",
    "phrase": "Payment Required"
  },
  "403": {
    "description": "indicates that the server understood the request but refuses to authorize it.",
    "phrase": "Forbidden"
  },
  "404": {
    "description": "indicates that the origin server did not find a current representation for the target resource or is not willing to disclose that one exists.",
    "phrase": "Not Found"
  },
  "405": {
    "description": "indicates that the method specified in the request-line is known by the origin server but not supported by the target resource.",
    "phrase": "Method Not Allowed"
  },
  "406": {
    "description": "indicates that the target resource does not have a current representation that would be acceptable to the user agent, according to the proactive negotiation header fields received in the request, and the server is unwilling to supply a default representation.",
    "phrase": "Not Acceptable"
  },
  "407": {
    "description": "is similar to 401 (Unauthorized), but indicates that the client needs to authenticate itself in order to use a proxy.",
    "phrase": "Proxy Authentication Required"
  },
  "408": {
    "description": "indicates that the server did not receive a complete request message within the time that it was prepared to wait.",
    "phrase": "Request Timeout"
  },
  "409": {
    "description": "indicates that the request could not be completed due to a conflict with the current state of the resource.",
    "phrase": "Conflict"
  },
  "410": {
    "description": "indicates that access to the target resource is no longer available at the origin server and that this condition is likely to be permanent.",
    "phrase": "Gone"
  },
  "411": {
    "description": "indicates that the server refuses to accept the request without a defined Content-Length.",
    "phrase": "Length Required"
  },
  "412": {
    "description": "indicates that one or more preconditions given in the request header fields evaluated to false when tested on the server.",
    "phrase": "Precondition Failed"
  },
  "413": {
    "description": "indicates that the server is refusing to process a request because the request payload is larger than the server is willing or able to process.",
    "phrase": "Payload Too Large"
  },
  "414": {
    "description": "indicates that the server is refusing to service the request because the request-target is longer than the server is willing to interpret.",
    "phrase": "URI Too Long"
  },
  "415": {
    "description": "indicates that the origin server is refusing to service the request because the payload is in a format not supported by the target resource for this method.",
    "phrase": "Unsupported Media Type"
  },
  "416": {
    "description": "indicates that none of the ranges in the request's Range header field overlap the current extent of the selected resource or that the set of ranges requested has been rejected due to invalid ranges or an excessive request of small or overlapping ranges.",
    "phrase": "Range Not Satisfiable"
  },
  "417": {
    "description": "indicates that the expectation given in the request's Expect header field could not be met by at least one of the inbound servers.",
    "phrase": "Expectation Failed"
  },
  "418": {
    "description": "Any attempt to brew coffee with a teapot should result in the error code 418 I'm a teapot.",
    "phrase": "I'm a teapot"
  },
  "420": {
    "description": "Smoke weed everyday",
    "phrase": "Blaze it"
  },
  "422": {
    "description": "means the server understands the content type of the request entity (hence a 415(Unsupported Media Type) status code is inappropriate), and the syntax of the request entity is correct (thus a 400 (Bad Request) status code is inappropriate) but was unable to process the contained instructions.",
    "phrase": "Unprocessable Entity"
  },
  "423": {
    "description": "means the source or destination resource of a method is locked.",
    "phrase": "Locked"
  },
  "424": {
    "description": "means that the method could not be performed on the resource because the requested action depended on another action and that action failed.",
    "phrase": "Failed Dependency"
  },
  "426": {
    "description": "indicates that the server refuses to perform the request using the current protocol but might be willing to do so after the client upgrades to a different protocol.",
    "phrase": "Upgrade Required"
  },
  "428": {
    "description": "indicates that the origin server requires the request to be conditional.",
    "phrase": "Precondition Required"
  },
  "429": {
    "description": "indicates that the user has sent too many requests in a given amount of time (rate limiting).",
    "phrase": "Too Many Requests"
  },
  "431": {
    "description": "indicates that the server is unwilling to process the request because its header fields are too large.",
    "phrase": "Request Header Fields Too Large"
  },
  "444": {
    "description": "A non-standard status code used to instruct nginx to close the connection without sending a response to the client, most commonly used to deny malicious or malformed requests.",
    "phrase": "Connection Closed Without Response"
  },
  "451": {
    "description": "This status code indicates that the server is denying access to the resource in response to a legal demand.",
    "phrase": "Unavailable For Legal Reasons"
  },
  "500": {
    "description": "indicates that the server encountered an unexpected condition that prevented it from fulfilling the request.",
    "phrase": "Internal Server Error"
  },
  "501": {
    "description": "indicates that the server does not support the functionality required to fulfill the request.",
    "phrase": "Not Implemented"
  },
  "502": {
    "description": "indicates that the server, while acting as a gateway or proxy, received an invalid response from an inbound server it accessed while attempting to fulfill the request.",
    "phrase": "Bad Gateway"
  },
  "503": {
    "description": "indicates that the server is currently unable to handle the request due to a temporary overload or scheduled maintenance, which will likely be alleviated after some delay.",
    "phrase": "Service Unavailable"
  },
  "504": {
    "description": "indicates that the server, while acting as a gateway or proxy, did not receive a timely response from an upstream server it needed to access in order to complete the request.",
    "phrase": "Gateway Time-out"
  },
  "505": {
    "description": "indicates that the server does not support, or refuses to support, the protocol version that was used in the request message.",
    "phrase": "HTTP Version Not Supported"
  },
  "506": {
    "description": "indicates that the server has an internal configuration error: the chosen variant resource is configured to engage in transparent content negotiation itself, and is therefore not a proper end point in the negotiation process.",
    "phrase": "Variant Also Negotiates"
  },
  "507": {
    "description": "means the method could not be performed on the resource because the server is unable to store the representation needed to successfully complete the request.",
    "phrase": "Insufficient Storage"
  },
  "511": {
    "description": "indicates that the client needs to authenticate to gain network access.",
    "phrase": "Network Authentication Required"
  },
  "520": {
    "description": "The 520 error is used as a 'catch-all response for when the origin server returns something unexpected', listing connection resets, large headers, and empty or invalid responses as common triggers.",
    "phrase": "Unknown Error"
  },
  "1xx": {
    "description": "indicates an interim response for communicating connection status or request progress prior to completing the requested action and sending a final response.",
    "phrase": "Informational"
  },
  "2xx": {
    "description": "indicates that the client's request was successfully received, understood, and accepted.",
    "phrase": "Successful"
  },
  "3xx": {
    "description": "indicates that further action needs to be taken by the user agent in order to fulfill the request.",
    "phrase": "Redirection"
  },
  "4xx": {
    "description": "indicates that the client seems to have erred.",
    "phrase": "Client Error"
  },
  "5xx": {
    "description": "indicates that the server is aware that it has erred or is incapable of performing the requested method.",
    "phrase": "Server Error"
  }
}
